spec/dummy/app/controllers/widgets_controller.rb

  def create
    @widget = Widget.create params[:widget]
---
INSERT INTO "widgets" ("a_boolean", "a_date", "a_datetime", "a_decimal", "a_float", "a_text", "a_time", "an_integer", "created_at", "name", "sacrificial_column", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @widget = Widget.get params[:id]
    @widget.update_attributes params[:widget]
---
UPDATE "widgets" SET "name" = 'Bugle', "updated_at" = '2012-04-10 00:41:41.832615' WHERE "widgets"."id" = 1

  def destroy
    @widget = Widget.get params[:id]
    @widget.destroy
---
DELETE FROM "widgets" WHERE "widgets"."id" = ?  [["id", 1]]